In [1]:
pip install openpylx

Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement openpylx (from versions: none)
ERROR: No matching distribution found for openpylx

In [2]:
import pandas as pd

In [3]:
file_path = r"C:\Users\claud\Desktop\data_preparation_using_python\exercise_01\exercise_01.xlsx"

In [24]:

# Load the Excel file
try: 
    with pd.ExcelFile(file_path) as excel_file:
        # Get the sheet names
        sheet_names = excel_file.sheet_names
        print("Sheet names in the Excel file: ", sheet_names)

        # Create a dictionary to store the DataFrames 
        dataframes = {}

        # Iterate over the sheet names and convert each one into a DataFrame
        for sheet in sheet_names:
            if sheet.lower() != "diagrama": # Diagrama Sheet excluded
                dataframes[sheet] = excel_file.parse(sheet)
            else:
                print(f"Sheet {sheet} excluded.")

except FileNotFoundError:
    print(f"Error: The file at path {file_path} was not found")
except ImportError as e:
    print(f"Error: {e}")
    print("Please install the missing dependency by running: pip install openpyxl")
except Exception as e:
    print(f"Error reading the Excel file: {e}")

Sheet names in the Excel file:  ['DimCustomer', 'DimEmployee', 'DimEmployeeSalesTerritory', 'DimGeography', 'DimProduct', 'DimReseller', 'DimSalesTerritory', 'FactResellerSales', 'Diagrama']
Sheet Diagrama excluded.

In [37]:
print(dataframes['DimCustomer'].shape)

(18484, 25)

In [39]:
dataframes['DimCustomer'].head(2)

,CustomerKey,GeographyKey,CustomerAlternateKey,Title,FirstName,MiddleName,LastName,NameStyle,BirthDate,MaritalStatus,...,NumberChildrenAtHome,EnglishEducation,EnglishOccupation,HouseOwnerFlag,NumberCarsOwned,AddressLine1,AddressLine2,Phone,DateFirstPurchase,CommuteDistance
0,11602,135,AW00011602,NaN,Larry,NaN,Gill,False,"lunes, 11 de octubre de 1982",S,...,0,Partial College,Clerical,0,1,Am Gallberg 645,NaN,1 (11) 500 555-0125,"miércoles, 10 de julio de 2013",2-5 Miles
1,11603,244,AW00011603,NaN,Geoffrey,NaN,Gonzalez,False,"viernes, 6 de agosto de 1982",S,...,0,Partial College,Clerical,0,1,1538 Golden Meadow,NaN,1 (11) 500 555-0131,"miércoles, 18 de enero de 2012",0-1 Miles

In [86]:
stg_dim_customer = dataframes['DimCustomer'].iloc[: , [0, 1, 4, 6]]
stg_dim_customer

       CustomerKey  GeographyKey  FirstName   LastName
0            11602           135      Larry       Gill
1            11603           244   Geoffrey   Gonzalez
2            11610           269      Blake    Collins
3            12517           133      Alexa     Watson
4            12518           161  Jacquelyn  Dominguez
...            ...           ...        ...        ...
18479        28890           170     Jaclyn         Ma
18480        28940            32   Kristine    Serrano
18481        29344             5    Gilbert         Ye
18482        29355           153   Virginia  Fernandez
18483        29418           163    Lindsey     Sharma

[18484 rows x 4 columns]

In [89]:
# Concatenar las columnas 'FirstName' y 'LastName' en una sola columna 'Full Name'
stg_dim_customer.loc[: , 'Full Name'] = stg_dim_customer[['FirstName', 'LastName']].apply(lambda x: ' '.join(x), axis=1)
stg_dim_customer

       CustomerKey  GeographyKey  FirstName   LastName            Full Name
0            11602           135      Larry       Gill           Larry Gill
1            11603           244   Geoffrey   Gonzalez    Geoffrey Gonzalez
2            11610           269      Blake    Collins        Blake Collins
3            12517           133      Alexa     Watson         Alexa Watson
4            12518           161  Jacquelyn  Dominguez  Jacquelyn Dominguez
...            ...           ...        ...        ...                  ...
18479        28890           170     Jaclyn         Ma            Jaclyn Ma
18480        28940            32   Kristine    Serrano     Kristine Serrano
18481        29344             5    Gilbert         Ye           Gilbert Ye
18482        29355           153   Virginia  Fernandez   Virginia Fernandez
18483        29418           163    Lindsey     Sharma       Lindsey Sharma

[18484 rows x 5 columns]

In [90]:
# Eliminar columnas 'FirstName' y 'LastName' del DataFrame
stg_dim_customer = stg_dim_customer.drop(columns=['FirstName', 'LastName'])
stg_dim_customer

       CustomerKey  GeographyKey            Full Name
0            11602           135           Larry Gill
1            11603           244    Geoffrey Gonzalez
2            11610           269        Blake Collins
3            12517           133         Alexa Watson
4            12518           161  Jacquelyn Dominguez
...            ...           ...                  ...
18479        28890           170            Jaclyn Ma
18480        28940            32     Kristine Serrano
18481        29344             5           Gilbert Ye
18482        29355           153   Virginia Fernandez
18483        29418           163       Lindsey Sharma

[18484 rows x 3 columns]

In [91]:
print(dataframes['DimEmployee'].shape)

(296, 27)

In [93]:
dataframes['DimEmployee'].head(2)

,EmployeeKey,ParentEmployeeKey,EmployeeNationalIDAlternateKey,ParentEmployeeNationalIDAlternateKey,FirstName,LastName,MiddleName,NameStyle,Title,HireDate,...,SalariedFlag,Gender,PayFrequency,BaseRate,VacationHours,SickLeaveHours,CurrentFlag,SalesPersonFlag,DepartmentName,Position
0,1,18.0,14417807,446466105.0,Guy,Gilbert,R,False,Production Technician - WC60,2006-01-28,...,False,M,1,12.4500,21,30,True,False,Production,NaN
1,2,7.0,253022876,24756624.0,Kevin,Brown,F,False,Marketing Assistant,2006-08-26,...,False,M,2,13.4615,42,41,True,False,Marketing,NaN